In [1]:
# Import libraries
import pandas as pd
import os
from dotenv import load_dotenv

# Load the ipython-sql extension
%load_ext sql

In [2]:
# Load .env file with PostgreSQL server credentials
dotenv_path = os.path.join(os.getcwd(), 'DB_URL.env')
load_dotenv(dotenv_path)

# Configure the connection using the DB_URL environment variable
%sql $DB_URL

In [3]:
%%sql

-- Dataset timeframe
SELECT MIN(date) AS min_date,
	   MAX(date) AS max_date
  FROM layoffs
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
1 rows affected.

[(datetime.date(2020, 3, 11), datetime.date(2024, 5, 24))]

The data availability is from when COVID-19 was declared as a pandemic (03/11/2020)Â to present (05/24/2024).

In [4]:
%%sql

-- Layoff grand total
SELECT SUM(total_laid_off)
  FROM layoffs
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
1 rows affected.

[(613425,)]

Over 600,000 people had lost their jobs worldwide from 2020 to 2024.

In [5]:
%%sql

-- Layoff grand total by year
SELECT EXTRACT(YEAR FROM date) AS year, SUM(total_laid_off) AS layoff_grand_total
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
   AND date IS NOT NULL
 GROUP BY 1
 ORDER BY 1 DESC
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
5 rows affected.

[(Decimal('2024'), 89105),
 (Decimal('2023'), 263180),
 (Decimal('2022'), 164319),
 (Decimal('2021'), 15823),
 (Decimal('2020'), 80998)]

- Layoffs peaked in 2023 with over 250,000 people losing their jobs. 

- There was a significant drop in 2024, with about 90,000 layoffs in the first half of the year, indicating a downward trend.

In [6]:
%%sql

-- Top 10 companies by grand total layoffs
SELECT company, SUM(total_laid_off) AS layoff_grand_total
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
 GROUP BY company
 ORDER BY layoff_grand_total DESC
 LIMIT 10
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
10 rows affected.

[('Amazon', 27840),
 ('Meta', 21000),
 ('Tesla', 14500),
 ('Google', 13372),
 ('Microsoft', 13058),
 ('Dell', 12650),
 ('SAP', 11000),
 ('Salesforce', 10840),
 ('Philips', 10000),
 ('Cisco', 8700)]

Big tech companies were significantly impacted by layoffs. During this period, Amazon, Meta, and Google have experienced the highest number of layoffs.

In [7]:
%%sql

-- Layoff grand total by industry
SELECT industry, SUM(total_laid_off) AS layoff_grand_total
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
 GROUP BY industry
 ORDER BY layoff_grand_total DESC
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
31 rows affected.

[('Retail', 70157),
 ('Consumer', 67575),
 ('Transportation', 58667),
 ('Other', 58261),
 ('Food', 45245),
 ('Finance', 42913),
 ('Hardware', 37750),
 ('Healthcare', 36717),
 ('Travel', 23059),
 ('Real Estate', 19108),
 ('Education', 18510),
 ('Infrastructure', 14941),
 ('Sales', 14933),
 ('Crypto', 13588),
 ('Marketing', 12413),
 ('Security', 9842),
 ('Fitness', 9671),
 ('Media', 9255),
 ('Data', 8855),
 ('HR', 8197),
 ('Support', 6191),
 ('Manufacturing', 5642),
 ('Logistics', 5356),
 ('Recruiting', 5101),
 ('Construction', 3863),
 ('Energy', 3067),
 ('Product', 2097),
 ('Aerospace', 1188),
 ('Legal', 966),
 ('AI', 262),
 (None, 35)]

Consumer and retail industries experienced the highest number of layoffs during this period.

In [8]:
%%sql

-- Layoff grand total by country
SELECT country, SUM(total_laid_off) AS layoff_grand_total
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
 GROUP BY country
 ORDER BY layoff_grand_total DESC
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
51 rows affected.

[('United States', 412662),
 ('India', 51234),
 ('Germany', 26353),
 ('United Kingdom', 19019),
 ('Netherlands', 18445),
 ('Sweden', 13619),
 ('Brazil', 11323),
 ('Canada', 10321),
 ('Singapore', 7419),
 ('China', 7190),
 ('Israel', 5756),
 ('Indonesia', 4761),
 ('Japan', 4165),
 ('Australia', 3623),
 ('Nigeria', 2045),
 ('France', 1825),
 ('New Zealand', 1100),
 ('Cayman Islands', 1060),
 ('United Arab Emirates', 995),
 ('Kenya', 988),
 ('Austria', 740),
 ('Ireland', 737),
 ('Hong Kong', 730),
 ('Estonia', 582),
 ('Spain', 553),
 ('Chile', 525),
 ('Norway', 455),
 ('Poland', 453),
 ('Russia', 400),
 ('South Korea', 395),
 ('Switzerland', 362),
 ('Saudi Arabia', 340),
 ('Argentina', 323),
 ('Finland', 320),
 ('Denmark', 319),
 ('Czech Republic', 316),
 ('Senegal', 300),
 ('Mexico', 270),
 ('Romania', 252),
 ('Myanmar', 200),
 ('Ghana', 150),
 ('Colombia', 130),
 ('Bulgaria', 120),
 ('Portugal', 115),
 ('Malaysia', 100),
 ('Seychelles', 75),
 ('Lithuania', 60),
 ('Thailand', 55),
 ('Belgium', 50),
 ('Ukraine', 50),
 ('Luxembourg', 45)]

Over time, the United States leads globally with over 400,000 layoffs, about 9 times more than India, which ranks second with just over 50,000 layoffs.

In [9]:
%%sql

-- Calculate percentage of layoffs in the United States throughout the years
SELECT ROUND(((SELECT SUM(total_laid_off) 
			     FROM layoffs
			    WHERE country = 'United States') * 1.0 / (SELECT SUM(total_laid_off)
														    FROM layoffs)
			  ) * 100, 1) AS us_layoffs_percent
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
1 rows affected.

[(Decimal('67.3'),)]

The United States has by far the highest number of layoffs during this period, making up about 70% of the total layoffs worlwide.

In [10]:
%%sql

-- Monthly worlwide total layoffs & rolling total
WITH
monthly_layoffs AS (
SELECT EXTRACT(YEAR FROM date) AS year, EXTRACT(MONTH FROM date) AS month, SUM(total_laid_off) AS total_layoffs
  FROM layoffs
 WHERE date IS NOT NULL
 GROUP BY 1, 2
)

SELECT year, month, total_layoffs,
	   SUM(total_layoffs) OVER(ORDER BY year, month) AS total_layoffs
  FROM monthly_layoffs
 ORDER BY year, month
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
50 rows affected.

[(Decimal('2020'), Decimal('3'), 9628, Decimal('9628')),
 (Decimal('2020'), Decimal('4'), 26710, Decimal('36338')),
 (Decimal('2020'), Decimal('5'), 25804, Decimal('62142')),
 (Decimal('2020'), Decimal('6'), 7627, Decimal('69769')),
 (Decimal('2020'), Decimal('7'), 7112, Decimal('76881')),
 (Decimal('2020'), Decimal('8'), 1969, Decimal('78850')),
 (Decimal('2020'), Decimal('9'), 609, Decimal('79459')),
 (Decimal('2020'), Decimal('10'), 450, Decimal('79909')),
 (Decimal('2020'), Decimal('11'), 237, Decimal('80146')),
 (Decimal('2020'), Decimal('12'), 852, Decimal('80998')),
 (Decimal('2021'), Decimal('1'), 6813, Decimal('87811')),
 (Decimal('2021'), Decimal('2'), 868, Decimal('88679')),
 (Decimal('2021'), Decimal('3'), 47, Decimal('88726')),
 (Decimal('2021'), Decimal('4'), 261, Decimal('88987')),
 (Decimal('2021'), Decimal('6'), 2434, Decimal('91421')),
 (Decimal('2021'), Decimal('7'), 80, Decimal('91501')),
 (Decimal('2021'), Decimal('8'), 1867, Decimal('93368')),
 (Decimal('2021'), Decimal('9'), 161, Decimal('93529')),
 (Decimal('2021'), Decimal('10'), 22, Decimal('93551')),
 (Decimal('2021'), Decimal('11'), 2070, Decimal('95621')),
 (Decimal('2021'), Decimal('12'), 1200, Decimal('96821')),
 (Decimal('2022'), Decimal('1'), 510, Decimal('97331')),
 (Decimal('2022'), Decimal('2'), 3685, Decimal('101016')),
 (Decimal('2022'), Decimal('3'), 5714, Decimal('106730')),
 (Decimal('2022'), Decimal('4'), 4128, Decimal('110858')),
 (Decimal('2022'), Decimal('5'), 12985, Decimal('123843')),
 (Decimal('2022'), Decimal('6'), 17394, Decimal('141237')),
 (Decimal('2022'), Decimal('7'), 16238, Decimal('157475')),
 (Decimal('2022'), Decimal('8'), 13055, Decimal('170530')),
 (Decimal('2022'), Decimal('9'), 5881, Decimal('176411')),
 (Decimal('2022'), Decimal('10'), 20471, Decimal('196882')),
 (Decimal('2022'), Decimal('11'), 53594, Decimal('250476')),
 (Decimal('2022'), Decimal('12'), 10664, Decimal('261140')),
 (Decimal('2023'), Decimal('1'), 89709, Decimal('350849')),
 (Decimal('2023'), Decimal('2'), 39902, Decimal('390751')),
 (Decimal('2023'), Decimal('3'), 37963, Decimal('428714')),
 (Decimal('2023'), Decimal('4'), 20100, Decimal('448814')),
 (Decimal('2023'), Decimal('5'), 15127, Decimal('463941')),
 (Decimal('2023'), Decimal('6'), 11206, Decimal('475147')),
 (Decimal('2023'), Decimal('7'), 10650, Decimal('485797')),
 (Decimal('2023'), Decimal('8'), 10178, Decimal('495975')),
 (Decimal('2023'), Decimal('9'), 4707, Decimal('500682')),
 (Decimal('2023'), Decimal('10'), 8076, Decimal('508758')),
 (Decimal('2023'), Decimal('11'), 8373, Decimal('517131')),
 (Decimal('2023'), Decimal('12'), 7189, Decimal('524320')),
 (Decimal('2024'), Decimal('1'), 34107, Decimal('558427')),
 (Decimal('2024'), Decimal('2'), 15589, Decimal('574016')),
 (Decimal('2024'), Decimal('3'), 7403, Decimal('581419')),
 (Decimal('2024'), Decimal('4'), 22352, Decimal('603771')),
 (Decimal('2024'), Decimal('5'), 9654, Decimal('613425'))]

- Layoffs spiked in early 2020 due to COVID-19, stabilized in 2021, increased again in 2022, and peaked dramatically in early 2023.

- In early 2024, layoffs dropped by about 60% compared to 2023, indicating a significant overall decrease.

In [11]:
%%sql

-- Top 5 companies with highest layoffs by year
WITH
company_year_layoffs AS (
SELECT company, EXTRACT(YEAR FROM date) AS year, SUM(total_laid_off) AS total_layoffs
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
   AND date IS NOT NULL
 GROUP BY 1, 2
),

company_year_rank AS (
SELECT company, year, total_layoffs,
	   DENSE_RANK() OVER(PARTITION BY year
						 	 ORDER BY total_layoffs DESC) AS ranking
  FROM company_year_layoffs
 ORDER BY ranking
)

SELECT *
  FROM company_year_rank
 WHERE ranking <= 5
 ORDER BY year, ranking
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
26 rows affected.

[('Uber', Decimal('2020'), 7525, 1),
 ('Booking.com', Decimal('2020'), 4375, 2),
 ('Groupon', Decimal('2020'), 2800, 3),
 ('Swiggy', Decimal('2020'), 2250, 4),
 ('Airbnb', Decimal('2020'), 1900, 5),
 ('Bytedance', Decimal('2021'), 3600, 1),
 ('Katerra', Decimal('2021'), 2434, 2),
 ('Zillow', Decimal('2021'), 2000, 3),
 ('Instacart', Decimal('2021'), 1877, 4),
 ('WhiteHat Jr', Decimal('2021'), 1800, 5),
 ('Meta', Decimal('2022'), 11000, 1),
 ('Amazon', Decimal('2022'), 10150, 2),
 ('Cisco', Decimal('2022'), 4100, 3),
 ('Peloton', Decimal('2022'), 4084, 4),
 ('Philips', Decimal('2022'), 4000, 5),
 ('Carvana', Decimal('2022'), 4000, 5),
 ('Amazon', Decimal('2023'), 17260, 1),
 ('Google', Decimal('2023'), 12115, 2),
 ('Microsoft', Decimal('2023'), 11158, 3),
 ('Meta', Decimal('2023'), 10000, 4),
 ('Ericsson', Decimal('2023'), 8500, 5),
 ('Tesla', Decimal('2024'), 14500, 1),
 ('SAP', Decimal('2024'), 8000, 2),
 ('Dell', Decimal('2024'), 6000, 3),
 ('Cisco', Decimal('2024'), 4250, 4),
 ('Toshiba', Decimal('2024'), 4000, 5)]

- Tech companies consistently have high layoffs throughout the years. Amazon stands out in 2023 with the highest laid off people across all companies during this period.

- In the first half of 2024, Tesla leads with over 14,000 layoffs so far, which positions the company at 3rd place of total layoffs from 2020 to present.

In [12]:
%%sql

-- Top 5 countries with highest layoffs by year
WITH
country_year_layoffs AS (
SELECT country, EXTRACT(YEAR FROM date) AS year, SUM(total_laid_off) AS total_layoffs
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
   AND date IS NOT NULL
 GROUP BY 1, 2
),

country_year_rank AS (
SELECT country, year, total_layoffs,
	   DENSE_RANK() OVER(PARTITION BY year
						 	 ORDER BY total_layoffs DESC) AS ranking
  FROM country_year_layoffs
 ORDER BY ranking
)

SELECT *
  FROM country_year_rank
 WHERE ranking <= 5
 ORDER BY year, ranking
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
25 rows affected.

[('United States', Decimal('2020'), 50385, 1),
 ('India', Decimal('2020'), 12932, 2),
 ('Netherlands', Decimal('2020'), 4600, 3),
 ('Brazil', Decimal('2020'), 3341, 4),
 ('Singapore', Decimal('2020'), 2361, 5),
 ('United States', Decimal('2021'), 9470, 1),
 ('India', Decimal('2021'), 4080, 2),
 ('China', Decimal('2021'), 1800, 3),
 ('Germany', Decimal('2021'), 387, 4),
 ('Canada', Decimal('2021'), 45, 5),
 ('United States', Decimal('2022'), 109695, 1),
 ('India', Decimal('2022'), 14224, 2),
 ('Netherlands', Decimal('2022'), 5420, 3),
 ('Brazil', Decimal('2022'), 5007, 4),
 ('Canada', Decimal('2022'), 3936, 5),
 ('United States', Decimal('2023'), 180101, 1),
 ('India', Decimal('2023'), 16398, 2),
 ('Germany', Decimal('2023'), 13128, 3),
 ('Sweden', Decimal('2023'), 11295, 4),
 ('United Kingdom', Decimal('2023'), 9402, 5),
 ('United States', Decimal('2024'), 63011, 1),
 ('Germany', Decimal('2024'), 8700, 2),
 ('United Kingdom', Decimal('2024'), 5390, 3),
 ('Japan', Decimal('2024'), 4000, 4),
 ('India', Decimal('2024'), 3600, 5)]

- The United States consistently appears with the highest layoff numbers throughout the years, peaking significantly in 2023 with over 180,000 layoffs.

- In the first half of 2024, the United States has the highest number of layoffs by far, followed by Germany, the UK, Japan, and India.

In [13]:
%%sql

-- Top 5 US locations with highest layoffs by year
WITH
us_year_layoffs AS (
SELECT location, EXTRACT(YEAR FROM date) AS year, SUM(total_laid_off) AS total_layoffs
  FROM layoffs
 WHERE total_laid_off IS NOT NULL
   AND date IS NOT NULL
   AND country = 'United States'
 GROUP BY 1, 2
),

us_year_rank AS (
SELECT location, year, total_layoffs,
	   DENSE_RANK() OVER(PARTITION BY year
						 	 ORDER BY total_layoffs DESC) AS ranking
  FROM us_year_layoffs
 ORDER BY ranking
)

SELECT *
  FROM us_year_rank
 WHERE ranking <= 5
 ORDER BY year, ranking
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
25 rows affected.

[('SF Bay Area', Decimal('2020'), 28333, 1),
 ('New York City', Decimal('2020'), 4971, 2),
 ('Boston', Decimal('2020'), 4305, 3),
 ('Chicago', Decimal('2020'), 3058, 4),
 ('Los Angeles', Decimal('2020'), 1943, 5),
 ('SF Bay Area', Decimal('2021'), 6024, 1),
 ('Seattle', Decimal('2021'), 2100, 2),
 ('New York City', Decimal('2021'), 982, 3),
 ('Chicago', Decimal('2021'), 243, 4),
 ('Boston', Decimal('2021'), 80, 5),
 ('SF Bay Area', Decimal('2022'), 50781, 1),
 ('New York City', Decimal('2022'), 16285, 2),
 ('Seattle', Decimal('2022'), 13070, 3),
 ('Phoenix', Decimal('2022'), 4537, 4),
 ('Los Angeles', Decimal('2022'), 3941, 5),
 ('SF Bay Area', Decimal('2023'), 78640, 1),
 ('Seattle', Decimal('2023'), 32138, 2),
 ('New York City', Decimal('2023'), 10263, 3),
 ('Austin', Decimal('2023'), 9415, 4),
 ('Boise', Decimal('2023'), 7275, 5),
 ('Austin', Decimal('2024'), 22058, 1),
 ('SF Bay Area', Decimal('2024'), 20243, 2),
 ('Seattle', Decimal('2024'), 4223, 3),
 ('New York City', Decimal('2024'), 3413, 4),
 ('Norwalk', Decimal('2024'), 3000, 5)]

- The San Francisco Bay Area consistently had the highest number of layoffs, but in 2024, Austin, Texas took the lead with over 22,000 layoffs so far.

- Other major cities like New York and Seattle have also been among the top 5 with the highest layoffs throughout the years.

In [14]:
%%sql

-- Number of companies that went bankrupt by year (i.e., those that laid off 100% of their personnel)
SELECT EXTRACT(YEAR FROM date) AS year, COUNT(percentage_laid_off)
  FROM layoffs
 WHERE percentage_laid_off = 1
 GROUP BY year
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
5 rows affected.

[(Decimal('2024'), 38),
 (Decimal('2023'), 105),
 (Decimal('2022'), 62),
 (Decimal('2021'), 8),
 (Decimal('2020'), 36)]

2023 also experienced the highest number of companies that went bankrupt based on the fact that their entire personnel was laid off based on the data available. See query below for important caveat.

In [15]:
%%sql

-- Count of nulls in percentage_laid_off
SELECT SUM(CASE
	   	   WHEN percentage_laid_off IS NULL THEN 1
	   	    END) AS null_count
  FROM layoffs
;

 * postgresql://postgres:***@localhost:5433/layoffs_project
1 rows affected.

[(696,)]

There is a significant proportion of missing values in the percentage_laid_off field, which could affect the accuracy of any calculations.